Revit 2027 API
RebarFreeFormAccessor.SetLayoutAsCustomSpacing Method
 Sets the Layout Rule property of rebar set to Custom Spacing.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsCustomSpacing(
	string customSpacingFormula
)
Public Sub SetLayoutAsCustomSpacing (
	customSpacingFormula As String
)
public:
void SetLayoutAsCustomSpacing(
	String^ customSpacingFormula
)
member SetLayoutAsCustomSpacing :
        customSpacingFormula : string -> unit
Parameters
customSpacingFormula String
 The layout formula.
Exceptions
Exception | Condition
ArgumentException |  The specified formula is not valid (doesn't have a valid syntax).
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace